{
  "Глобальная макроэкономика": "Во второй половине июня – июле 2025 года мировая экономика демонстрировала смешанные сигналы. Ведущие центробанки переходили к смягчению политики: ФРС США на заседании 18 июня сохранила ставку на уровне 4,25–4,5% годовых, тогда как ЕЦБ 5 июня снизил ставки на 0,25 п.п. (ставка по депозитам до 2,0%). Инфляция в целом замедлялась – например, глобальная базовая инфляция прогнозируется МВФ на уровне ~4,2% в 2025 году – однако в отдельных экономиках возникали всплески (годовая инфляция в США ускорилась до 2,7% в июне с 2,4% в мае). Прогнозы роста пересматривались: МВФ улучшил оценку мирового ВВП на 2025 год до 3,0% (учитывая устойчивость США и Китая), тогда как Всемирный банк, напротив, предупреждает о замедлении до ~2,3% (минимум с 2008 года). Объемы мировой торговли показывали признаки восстановления – по данным ВТО, торговля товарами в I квартале выросла более чем на 5% г/г, а по оценкам ЮНКТАД, глобальный экспорт в первом полугодии увеличился примерно на $300 млрд. При этом сохранялись риски торговых конфликтов: в конце июля США и Китай возобновили переговоры о тарифах. Сырьевые рынки оставались относительно стабильными: нефть марки Brent торговалась преимущественно в диапазоне $65–75 за баррель; к концу июля котировки выросли до ~$73, отыгрывая ожидания по спросу и решение ОПЕК+ придерживаться ограничений добычи. Цены на промышленные металлы и продовольствие несколько снизились по сравнению с пиком предыдущего года, что также способствовало ослаблению глобальной инфляции. В целом глобальная макроэкономическая картина летом 2025 г. характеризовалась умеренным ростом без явных рецессионных провалов, на фоне снижения инфляционного давления и постепенного поворота монетарной политики в сторону смягчения.",
  "Российская макроэкономика": "В российской экономике с июня по конец июля 2025 года прослеживалась тенденция к стабилизации после периода высокой инфляции. Годовая инфляция замедлилась: с 9,9% на конец мая до около 9,4% в июне и ~9,2% к концу июля (по оперативным данным Росстата), при этом в середине июля была зафиксирована краткосрочная недельная дефляция. На этом фоне Банк России впервые за долгое время перешёл к снижению ключевой ставки – 25 июля регулятор уменьшил ставку сразу на 200 б.п., с 20% до 18% годовых, сигнализируя начало цикла смягчения денежно-кредитной политики. Динамика ВВП оставалась сдержанной: международные оценki были ухудшены – МВФ в июльском обзоре снизил прогноз роста ВВП РФ на 2025 год до 0,9% (с предыдущих 1,5%), указывая на эффекты санкций и ограничений, тогда как российские власти сохраняли более оптимистичные ожидания (прогноз Минэкономразвития +2,5%, Банк России ожидает +1–2%). Внешние условия для экономики оставались сложными из-за санкций, но адаптация продолжалась. Евросоюз в конце июня утвердил 18-й пакет санкций, продлив действие экономических ограничений ещё на полгода и нацелившись на сокращение доходов РФ от энергетики и обход поставок высокотехнологичной продукции (в пакете, например, введены ограничения против связанного с Роснефтью индийского НПЗ Nayara). США при этом внесли точечные коррективы: в конце июня Вашингтон вывел из-под санкций ряд операций, связанных со строительством российским Росатомом АЭС «Пакш-2» в Венгрии, продемонстрировав избирательный подход. Внешняя торговля РФ слегка сократилась по сравнению с прошлым годом: по оценкам, совокупный товарооборот в январе–мае 2025 снизился примерно на 3%, причём торговля с Китаем в первом полугодии уменьшилась на ~9% г/г (в июне спад оборота с КНР ускорился до -14% г/г). Тем не менее, благодаря высоким ценам на сырье и переориентации экспорта на дружественные страны, экспортные доходы оставались значительными – аналитики ожидали, что по итогу года объем экспорта (около $475 млрд) и импорта (~$380 млрд) будет близок к уровню 2024 года. Бюджетная ситуация характеризовалась крупным дефицитом, но лучше прошлогодней: за первое полугодие федеральный бюджет исполнен с дефицитом ~3,7 трлн руб. (1,7% ВВП), что на 3,1 трлн руб. меньше, чем за ту же период 2024 г. Рост доходов (+2,8% г/г в I полугодии, ненефтегазовые доходы +13%) и замедление темпов расходования после рекордных авансов января смягчили фискальный разрыв, хотя расходы бюджета всё ещё значительно выше прошлогодних (+20% г/г за полугодие). Правительство заявило, что сохраняет контроль над исполнением бюджета и ожидает снижения дефицита во втором полугодии за счёт экономии и роста доходов. Курсовая динамика рубля в этот период была относительно стабильной: после ослабления весной российская валюта колебалась в пределах 80–85 руб. за доллар, во многом благодаря жесткой денежной политике и начавшемуся притоку экспортной выручки во втором квартале. В целом российская макроэкономика летом 2025 г. вошла в фазу умеренного оздоровления – инфляция снижалась, денежные власти начали осторожно смягчать политику, экономика росла незначительно, но избегала спада, приспосабливаясь к санкционным условиям через перенастройку торговли и бюджетную поддержку.",
  "Российская региональная экономика": "В июне–июле 2025 года на уровне регионов России произошел ряд значимых событий, отражающих как новые инвестиции, так и сохраняющиеся дисбалансы. Крупным драйвером стал Петербургский международный экономический форум (ПМЭФ-2025) в июне, где субъекты РФ заключили множество инвестиционных соглашений. Общий портфель контрактов, подписанных регионами на форуме, оценивается примерно в 7,5 трлн рублей – средства пойдут на проекты в промышленности, инфраструктуре, туризме, высоких технологиях и экологии. Так, Санкт-Петербург и Ленинградская область договорились с крупными компаниями (Сбербанк, ГК \"АБЗ-1\" и др.) о совместной реализации инфраструктурных проектов (строительство дорог, модернизация инженерных сетей), а также объявили о строительстве нового турбинного завода Росатома в Колпино (близ Ижорских заводов) – инвестиции в высокотехнологичное машиностроительное производство оценены в десятки млрд рублей, что усилит промышленный потенциал региона. Самарская область на ПМЭФ подписала порядка 20 соглашений более чем на 260 млрд руб., предусматривающих создание тысяч рабочих мест; среди ключевых направлений – развитие беспилотных авиационных систем (совместно с компаниями \"Транспорт будущего\" и АО \"ГЛОНАСС\"), а также крупные вложения в химическую промышленность (расширение производств \"КуйбышевАзот\" на ~25 млрд руб. и \"Тольяттиазот\" на 80+ млрд руб. с упором на экологичные технологии). В центральной России Тульская область привлекла инвестиции ГК \"Полипласт\" для строительства завода полимеров (~70 млрд руб., около 700 новых рабочих мест) и развития спортивной инфраструктуры (1,5 млрд руб. на объекты хоккея и следж-хоккея). Несколько регионов Сибири и Дальнего Востока объединились для совместного проекта: Приморский, Хабаровский и Забайкальский края вместе с Амурской областью впервые согласовали межрегиональный офсетный контракт – по условиям соглашения к 2027 году будет организовано новое производство медицинских датчиков (систем непрерывного мониторинга глюкозы), которые затем в 2027–2035 гг. регионы закупят для своих нужд (планируется выпуск не менее 582 тыс. устройств; объем инвестиций ~400 млн руб, гарантированный заказ – до 2,6 млрд руб). Этот уникальный для РФ проект, поддержанный Минвостокразвития, позволит локализовать высокотехнологичную продукцию и удовлетворить спрос дальневосточных регионов за счет собственного производителя. Одновременно в ряде регионов продолжилось создание специальных экономических режимов для привлечения капитала: например, приняты решения о запуске территорий опережающего развития (ТОР) в Магаданской области и других дальневосточных субъектах, стимулирующих инвестпроекты в добыче и переработке сырья. \nОднако наряду с позитивными новостями, сохранялись и региональные дисбалансы. Экономическая динамика заметно различалась между субъектами: наиболее развитые регионы Центра и юга фиксировали рост инвестактивности, тогда как отдельные индустриальные и удаленные территории сталкивались с проблемами. Так, крупнейший автопроизводитель ПАО \"Камаз\" (базируется в Татарстане) объявил о вынужденном сокращении рабочей недели с августа на части предприятий из-за спада спроса на грузовые автомобили – сигнал локального замедления в машиностроительном секторе. В транспортной сфере отмечен спад контейнерооборота портов Дальнего Востока: в июне объем перевалки контейнеров там снизился примерно на 21% г/г, что отражает перенаправление торговых потоков и логистические трудности на фоне санкций. Региональные бюджеты в целом по РФ оставались в относительно устойчивом состоянии благодаря федеральным трансфертам, но ряд регионов фиксировал дефициты выше плановых. Например, по данным на апрель, в Башкортостане дефицит бюджета достиг 8,6 млрд руб. (вдвое выше изначального годового ориентира), аналогичные проблемы с кассовым исполнением наблюдались в республике Саха (Якутия) и ряде других сырьевых регионов, пострадавших от колебаний цен и экспортных ограничений. При этом все субъекты продолжают получать поддержку центра: в июле правительство распределило дополнительные дотации на выравнивание бюджетной обеспеченности, особенно для наиболее нуждающихся областей и новых регионов. В новых субъектах (Донецкая и Луганская Народные Республики, Запорожская и Херсонская области) летом продолжалась работа по интеграции экономики – реализуются инфраструктурные проекты восстановления, открываются отделения федеральных банков и налоговых органов, хотя полноценное оживление деловой активности там пока затруднено. В целом же региональная экономика РФ в этот период характеризовалась активным притоком инвестиций в ряде территорий и одновременно сохраняющимися диспропорциями: богатые ресурсами и центры притяжения капитала развиваются ускоренно, тогда как депрессивные и отдаленные регионы требуют дальнейшей поддержки для стимулирования роста и занятости.",
  "Ключевые компании российской экономики": "Лето 2025 года ознаменовалось целым рядом заметных событий в крупнейших российских компаниях – как государственных корпорациях, так и частном секторе. В энергетическом секторе акционеры ПАО \"Газпром\" на годовом собрании 30 июня приняли резонансное решение вновь отказаться от выплаты годовых дивидендов (по итогам 2024 года). Компания мотивировала это необходимостью направить свободные средства на масштабные инвестиционные проекты и поддержание финансовой устойчивости на фоне санкций и сокращения экспорта трубопроводного газа. Отсутствие дивидендов второй год подряд выделяет Газпром среди голубых фишек (для сравнения, нефтяные компании дивиденды выплачивают), хотя финансовое положение концерна остается устойчивым благодаря доходам от продаж на азиатские рынки и внутреннего рынка. \nБанковский сектор продемонстрировал рекордные результаты: Сбербанк сообщил о чистой прибыли по МСФО в размере 859 млрд руб. за первое полугодие 2025 г., что на 5,3% больше, чем годом ранее. Во II квартале \"Сбер\" заработал около 423 млрд руб. чистой прибыли, сохранив высокую рентабельность на фоне роста кредитования и комиссионных доходов. Банк продолжил цифровую экспансию и привлечение клиентских средств, упрочивая свое доминирование на рынке. Другой госбанк, ВТБ, после убытков 2022 года вернулся к прибыльности и также рассчитывает возобновить выплату дивидендов в перспективе. \nВ нефтегазовой отрасли помимо Газпрома отметилась активность Новатэка: несмотря на санкционные ограничения, компания в июне успешно возобновила экспорт с нового завода СПГ \"Арктик СПГ-2\" на Гыдане. К концу месяца там было отгружено уже несколько танкеров с сжиженным газом, а суточная производительность первой технологической линии достигла рекордных значений (около 14 млн кубометров в газовом эквиваленте). Это свидетельствует о постепенном наращивании выпуска и налаживании логистики для обхода санкций – Новатэк планирует запустить вторую и третью линии проекта до 2026 года. Одновременно ПАО \"НК Роснефть\" сообщило, что в июле предприятия компании в рамках экопрограмм выпустили в российские водоемы более 4,7 млн мальков ценных видов рыб, продолжая природоохранные инициативы свыше 10 лет. Но были и негативные новости: в июле ЕС ввел санкции против индийского НПЗ Nayara Energy, акционером которого является Роснефть, пытаясь перекрыть обходные каналы сбыта российской нефти. Роснефть резко раскритиковала это решение, назвав его незаконным и экстерриториальным, однако заверила, что санкции не повлияют существенно на глобальный сбыт – компания перенаправляет поставки в другие азиатские страны. Кроме того, Роснефть продолжала внедрять новые технологии: сообщалось о проектах по цифровизации нефтедобычи с помощью ИИ и о совершенствовании методов исследований газовых скважин, что должно повысить эффективность добычи. \nВ металлургическом и горнодобывающем секторе значимым событием стали операционные результаты ГМК \"Норильский никель\". Компания отчиталась о небольшом снижении выпуска металлов во II квартале 2025 г.: производство никеля упало на ~6% г/г, меди – на 5%, а выпуск платиновых металлов сократился примерно на 10–11% на фоне плановых ремонтов и логистических трудностей. В связи с этим \"Норникель\" скорректировал прогноз на год, снизив ожидаемые объемы выпуска никеля и меди (прогноз по palladium и платине сохранён). Тем не менее, менеджмент подчеркнул, что долгосрочные перспективы остаются позитивными – конъюнктура цен благоприятна, а реализуемые инвестиционные проекты (например, экологическая модернизация и расширение Норильской промышленной площадки) укрепят позиции компании. Параллельно в металлургии продолжалось перераспределение экспортных потоков: сталелитейные гиганты вроде \"Северстали\" и НЛМК, потеряв рынки Европы, нарастили поставки в Китай, Турцию и на Ближний Восток, что отразилось в относительной стабилизации их выручки во II квартале. \nСреди промышленных флагманов внутреннего рынка отметился \"Камаз\": на фоне спада продаж грузовых автомобилей на внутреннем рынке предприятие объявило о переходе с августа на четырёхдневную рабочую неделю на ряде заводов, чтобы избежать накопления запасов и сохранить занятость. Тем временем АвтоВАЗ (бренд LADA) воспользовался уходом иностранных конкурентов и увеличил долю на рынке легковых автомобилей РФ свыше 40%, выпустив обновленные модели и нарастив производство – спрос на бюджетные отечественные машины рос, компенсируя снижение импорта. \nВ высокотехнологичном секторе продолжилась трансформация компаний под новым регулированием. Группа \"Яндекс\" завершила основной этап реструктуризации бизнеса: зарубежная холдинговая компания Yandex N.V. к лету выделила иностранные активы и продала их консорциуму инвесторов, а российские владельцы консолидировали контроль над операционными сервисами в РФ. В конце мая компания приняла решение снова выделить e-commerce направление (\"Яндекс.Маркет\") в отдельную структуру, чтобы сфокусироваться на развитии поиска, рекламы, такси и облачных технологий. Таким образом, крупнейшая ИТ-компания страны адаптируется к новым реалиям: сохраняя лидирующие позиции в онлайн-сервисах, но функционируя в условиях ограниченного доступа к зарубежным рынкам капитала и технологий. Другие ИТ-игроки – Mail.ru Group (VK) и Ozon – в этот период также укрепляли позиции: VK расширяла экосистему (от социальных сетей до fintech) и получала господдержку для импортозамещения ПО, а Ozon отчитался о росте товарооборота на своей маркетплейс-платформе более чем на 70% г/г во II квартале, подтверждая бум онлайн-торговли. \nНа фондовом рынке в июне–июле акции многих российских компаний показывали волатильность, реагируя на дивидендные решения и внешние риски. Индекс Мосбиржи в целом держался в районе 2800–3000 пунктов, инвесторы позитивно восприняли прибыль банков, но осторожно оценивали нефтегазовый сектор из-за геополитики. В итоге ключевые компании РФ летом 2025 года демонстрировали устойчивость и умение адаптироваться: банки и внутренний рынок услуг росли рекордными темпами, ресурсные гиганты переориентировали экспорт и запускали новые проекты, а промышленность и технологии искали точки роста несмотря на санкционное давление."
}