{
  "сценарий 1": {
    "спрос": 0,
    "потенциал": 0,
    "текст": "В базовом сценарии мировая экономика продолжает развиваться в рамках текущих трендов и в отсутствие новых шоков. Инфляция снижается, но в развитых странах это происходит медленнее, чем предполагалось. Поэтому центральные банки будут поддерживать жесткие денежно‑кредитные условия продолжительное время. При этом мировая экономика устойчива к повышению ставок. Введённые в отношении российской экономики ограничения сохраняются на всём прогнозном горизонте. С учётом перегрева российской экономики ВВП в 2024 году вырастет на 3,5–4,0 %. В 2025–2026 годах темпы роста замедлятся, в том числе под влиянием жёсткой ДКП, но устойчивый рост инвестиционного спроса продолжится. Это отражает сдвиг в структуре экономики в сторону увеличения доли инвестиций. В 2027 году российская экономика вернётся на траекторию сбалансированного роста в 1,5–2,5 %. Инфляция замедлится до 4,5–5,0 % в 2025 году и далее будет находиться вблизи 4 %. Для этого потребуется поддерживать жесткие денежно‑кредитные условия продолжительное время. Высокая ключевая ставка обеспечит необходимую реальную жёсткость условий для снижения кредитной и увеличения сберегательной активности экономических агентов в условиях их повышенных и незаякоренных инфляционных ожиданий. По прогнозу Банка России, в 2024 году средняя ключевая ставка составит 17,5 % годовых, в 2025 году будет находиться в диапазоне 17,0–20,0 %, в 2026 году — 12,0–13,0 %. В 2027 году она вернётся в долгосрочный нейтральный диапазон 7,5–8,5 %."
  },
  "сценарий 2": {
    "спрос": 0,
    "потенциал": 1,
    "текст": "Дезинфляционный сценарий предполагает более существенное расширение инвестиций в основной капитал и более высокие темпы прироста совокупной факторной производительности. Это приводит к увеличению потенциального выпуска: за счёт более высокого предложения товаров и услуг удаётся удовлетворить высокий внутренний спрос. Динамика ВВП складывается позитивнее, чем в базовом сценарии, за счёт более высоких темпов роста конечного потребления и валового накопления. При этом благодаря увеличению производительности труда снижается проинфляционное влияние высоких темпов роста реальных зарплат. В результате инфляционное давление уменьшается быстрее, чем в базовом сценарии. Это позволит Банку России перейти к снижению ключевой ставки раньше. В 2025 году средняя ставка будет в диапазоне 15,0–18,0 % (−2 п.п. к базовому сценарию), в 2026‑м — 10,0–11,0 % (−2 п.п.). В 2027 году, как и в базовом сценарии, она вернётся в долгосрочный нейтральный диапазон 7,5–8,5 %."
  },
  "сценарий 3": {
    "спрос": 1,
    "потенциал": 0,
    "текст": "В рисковом сценарии значительно ухудшаются внешние условия. Высокий уровень процентных ставок в мире и дисбалансы на финансовых рынках развитых стран в 2025 году приводят к мировому финансовому кризису, сопоставимому по масштабу с кризисом 2007–2008 годов. Активная деглобализация усиливает негативные эффекты кризиса. Санкционное давление на российскую экономику возрастает. На фоне рецессии в крупнейших экономиках падает мировой спрос; цены на нефть существенно ниже базового сценария на всём горизонте. Сокращение выпуска российской экономики продолжается два года; восстановительный рост 2,0–3,0 % начинается лишь в 2027‑м, а возвращение к сбалансированному росту уходит за пределы прогноза. Инфляция в 2025 году поднимается до 13,0–15,0 % из‑за резкого сокращения предложения. Чтобы предотвратить инфляционную спираль, Банк России значительно ужесточит ДКП: средняя ставка в 2025‑м — 22,0–25,0 %, в 2026‑м ДКП остаётся жёсткой. Инфляция приближается к цели только к концу горизонта."
  },
  "сценарий 4": {
    "спрос": -1,
    "потенциал": -1,
    "текст": "В проинфляционном сценарии факторы роста спроса носят устойчивый характер и сохраняются в 2025 году. Рынок труда остаётся жёстким, растёт инвестиционный спрос для расширения предложения. Высокий внутренний спрос и рост издержек на оплату труда усиливают давление на инфляцию. Дополнительный импульс спросу и ценам дают повышенные бюджетные расходы на льготное кредитование. Усиление протекционизма и тарифы на импорт удорожают импортные товары, повышают спрос на российские и толкают цены вверх. Эти факторы создают более высокое инфляционное давление, чем в базовом сценарии, поэтому Банк России проводит ещё более жёсткую ДКП. Средняя ставка: 2025 год — 20,0–23,0 %, 2026‑й — 15,0–16,0 %, 2027‑й — 8,5–9,5 %. К концу горизонта ставка остаётся выше нейтрального диапазона из‑за устойчиво высоких бюджетных расходов, а инфляция замедляется до 4,0–4,5 % лишь в 2026‑м и закрепляется на 4 % к 2027‑му."
  }
}